import React from 'react';
import '../CSS/AboutUs.css';

const AboutUs = () => {
  return (
    <div className="about-us-page">
      <header className="about-header">
        <h1>About MFU Wellness Center</h1>
        <p>
          ศูนย์บริการสุขภาพแบบครบวงจรแห่งภาคเหนือและอนุภูมิภาคลุ่มแม่น้ำโขง มหาวิทยาลัยแม่ฟ้าหลวง มีวัตถุประสงค์เพื่อสร้างและพัฒนาระบบบริการสุขภาพแบบครบวงจร ที่มีคุณภาพเป็นศูนย์กลางการดูแลสุขภาพและพัฒนาศักยภาพ
เสริมสร้างคุณภาพชีวิตและการมีสุขภาพที่ดีให้กับประชาชนทุกช่วงวัย โดยมีการให้บริการวิชาการ และการบริการด้านสุขภาพ โดยหน่วยบริการ ได้แก่ งานตรวจสุขภาพ งานผู้ป่วยนอก คลินิกวัคซีน คลินิกพิเศษปรึกษาภาวะน้ำหนักเกณฑ์
คลินิกผิวหนังและความงาม งานเวชศาสตร์ชะลอวัยและความ การจำหน่ายอาหารและเครื่องดื่มเพื่อสุขภาพ และห้องออกกำลังกาย(fitness) เป็นต้น
        </p>
      </header>

      <section className="about-section">
        <div className="about-content">
          <h2 className="about-heading">แนวทาง การดำเนินงาน</h2>
          <p>
            ด้านการส่งเสริม(Promotion) ให้ความรู้ความเข้าใจแก่ ประชาชนในการดูแลสุขภาพ โดยการอบรมให้ความรู้ การเผยแพร่ข้อมูลข่าวสารและการสร้างผู้นำด้านสุขภาพ ในชุมชน และการจัดกิจกรรมต่างๆ โดยเน้นการเข้าถึง กลุ่มเป้าหมายทุกช่วงวัย ทุกอาชีพ ให้สามารถดูแลสุขภาพ ด้วยตนเอง
          </p>
          <p>
            ด้านการป้องกัน(Prevention) ส่งเสริมให้ประชาชนปรับ พฤติกรรมในการดำรงชีวิตให้เหมาะสมเพื่อป้องกันไม่ให้ เกิดโรค ทั้งโรคติดต่อและโรคไม่ติดต่อ โดยการฉีดวัคซีน การออกกำลังกาย การรับประทานอาหารที่ถูกต้องในทุกระดับ และทุกอาชีพ
          </p>
          <p>
            ด้านการพยากรณ์โรค (Prediction) มุ่งเน้นการประเมิน สุขภาพเบื้องต้นให้กับประชาชนทุกช่วงวัย เพื่อคัดกรองหา รอยโรค หรือแนวโน้มที่จะเกิดโรคร้ายแรงหรือเรื้อรัง เพื่อให้ การรักษาอย่างทันเวลา ลดการเจ็บป่วยเรื้อรังหรือลดความ รุนแรงของโรค อันจะเป็นการลดค่าใช้จ่ายของรัฐบาลและ ไม่เป็นภาระของสังคม
          </p>
        </div>

        <div className="about-content">
          <h2 className="about-heading">พันธกิจ</h2>
          <p>
            สร้างและพัฒนาระบบบริการสุขภาพแบบครบวงจรที่มีคุณภาพชั้นนำ เป็นศูนย์กลางการดูแลและพัฒนาศักยภาพของประชาชนและผู้สูงอายุ เสริมสร้างคุณภาพชีวิตและการมีสุขภาพที่ดีให้กับประชาชนและผู้สูงอายุ
          </p>
          <p>
            ลดภาระการดูแลผู้เจ็บป่วย โดยลดอัตราการเข้ารับบริการรักษาในโรงพยาบาล สร้างรายได้จากการบริการสุขภาพ
          </p>
        </div>

        <div className="about-content">
          <h2 className="about-heading">วัตถุประสงค์</h2>
          <p>
            เพื่อให้เป็นหน่วยงานพัฒนาและขยายระบบบริการด้านสุขภาพ เป็นศูนย์กลางการดูแลสุขภาพและพัฒนาศักยภาพของประชาชน และผู้สูงอายุ
          </p>
          <p>
            ให้ความรู้ในการดูแลสุขภาพและการปรับเปลี่ยนพฤติกรรม ด้านสุขภาพ เสริมสร้างคุณภาพชีวิตและการมีสุขภาพที่ดีให้กับประชาชน และผู้สูงอายุ ตรวจประเมินสุขภาวะและการเจ็บป่วยตามกลุ่มเป้าหมายทุกช่วงวัย เพื่อลดภาวะการเจ็บป่วยที่ร้ายแรง
          </p>
        </div>
      </section>

      <section className="map-section">
        <h2 className="map-heading">Visit Us</h2>
        <p>Find us at the MFU Wellness Center, where wellness meets luxury.</p>
        <div className="map-container">
          <iframe
            src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3748.463736747542!2d99.87460457522982!3d20.03100963138025!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30d701663f5cd037%3A0xb40c9eb99044c4d6!2sMFU%20WELLNESS%20CENTER!5e0!3m2!1sen!2sth!4v1730976017243!5m2!1sen!2sth" 
            width="100%"
            height="400"
            style={{ border: 0 }}
            allowFullScreen=""
            loading="lazy"
            referrerPolicy="no-referrer-when-downgrade"
            title="MFU Wellness Center Map"
          ></iframe>
        </div>
      </section>
    </div>
  );
};

export default AboutUs;
